HarryZeng/STM32F051_LHSP6/MDK-ARM/main.c
}  

///*重设TIM1进入OnePule模式，用于控制脉冲个数*/

//void ChangeTIM1ToOnePulse(int Counter)
//{
//	TIM_TimeBaseInitTypeDef timer_init_structure;
//	TIM_Cmd(TIM1, DISABLE);
//	
//	timer_init_structure.TIM_RepetitionCounter = Counter;
//  TIM_TimeBaseInit(TIM1, &timer_init_structure);
//	
//	
//	TIM_SelectOnePulseMode(TIM1,TIM_OPMode_Single);
//	TIM_Cmd(TIM1, DISABLE);
//}

    
/****************************??????****************************/  
extern uint32_t   ShortCircuitLastTime;
volatile uint32_t timenum; 
extern uint8_t  	EventFlag; 
extern uint8_t 	ShortCircuit;
extern uint8_t 	ShortCircuitTimer;
extern int16_t OUT2_TimerCounter;

extern uint8_t SelfGetADCWell;
extern uint32_t ADC_ROW_Value[4];
extern uint8_t OUT2;
extern uint8_t OUT1;
extern uint32_t CPV;
uint8_t ADCIndex=0;
uint8_t DMAIndex=0;
static uint8_t DMA_GetADC_Counter;
int16_t selfADCValue[12];
uint32_t OUTSumADCValue=0;
uint32_t OUTADCValue=0;
uint8_t OUTADCValueIndex=0;
uint8_t LastRegisterA=0;

void TIM2_IRQHandler()  
{
    if(TIM_GetITStatus(TIM2, TIM_FLAG_Update))            //判断发生update事件中断  
    {  
				
        TIM_ClearITPendingBit(TIM2, TIM_FLAG_Update);     //清除update事件中断标志
    }  
}  

void TIM1_BRK_UP_TRG_COM_IRQHandler()  
{  
    if(TIM_GetITStatus(TIM1, TIM_FLAG_Update))            //判断发生update事件中断  
    {

      TIM_ClearITPendingBit(TIM1, TIM_FLAG_Update);     //清除update事件中断标志
    }  
} 

void TIM3_IRQHandler()
{
	  if(TIM_GetITStatus(TIM3, TIM_IT_Update))            //判断发生update事件中断  
    { 
				timenum++;
				//GPIOA->ODR ^= GPIO_Pin_10;
				if(timenum%10==0) /*5*10us=50us*/
				{
					//EventFlag = EventFlag | ADVtimeFlag;
					//GPIOA->ODR ^= GPIO_Pin_9;
					if(OUT2)
						OUT2_TimerCounter++;
					
					SMG_Diplay();
					Key_Scan();									//定时扫描按键
					ShortCircuitLastTime++;				
					if(ShortCircuit)
						ShortCircuitCounter++;
					else
						ShortCircuitCounter=0;
				}
//				if(timenum%80==0)  /*80*10us = 800us*/
//				{
//					OUT2_TimerCounter++;
//					EventFlag = EventFlag | D4toD1timeFlag;
//					
//				}
//				if(timenum%100==0)	/*120*10us = 1,000us*/
//				{
//					EventFlag = EventFlag | Blink500msFlag;
//					ShortCircuitLastTime++;				
//					if(ShortCircuit)
//						ShortCircuitCounter++;
//					else
//						ShortCircuitCounter=0;
//					Key_Scan();									//定时扫描按键
//				}
//				if(timenum%2000==0)	/*2000*10us = 20,000us = 20ms*/
//				{
//					EventFlag = EventFlag | ButtontimeFlag;
//				}	
//				if(timenum%10000==0)	/*10000*10us = 100,000us = 100ms*/
//				{
//					EventFlag = EventFlag | Blink100msFlag;
//				}	
				if(timenum>=5000)	/*5000*10us = 500,000us = 500ms*/
				{
					EventFlag = EventFlag | Blink500msFlag;
//					EventFlag = EventFlag &(~EndDispalyFlag);

					timenum = 0;
				}
			TIM_ClearITPendingBit(TIM3, TIM_IT_Update);     //清除update事件中断标志
		}
}

void DMA1_Channel1_IRQHandler()  
{  
//		if(DMA_GetITStatus(DMA_IT_HT))
//				;
    if(DMA_GetITStatus(DMA_IT_TC))                      //判断DMA传输完成中断  
    {   
				//GPIOA->ODR ^= GPIO_Pin_10;
//				ADC_ROW_Value[DMA_GetADC_Counter] = adc_dma_tab[0];
//				OUTSumADCValue += adc_dma_tab[0];
				DMA_GetADC_Counter++;

				if(DMA_GetADC_Counter>24)
				{
//					DMA_GetADC_Counter=0;
//					OUTADCValue= OUTSumADCValue/25;
//					OUTSumADCValue = 0;
					OUTADCValue = adc_dma_tab[0];
					sample_finish = 1;

//					OUT1_Mode.DelayCounter++;

//					/*设置OUT1的状态*/
//				// 	SetOUT1Status();
//					
//					if(LastRegisterA==0&&RegisterA==1)
//					{
//						CPV++;
//						if(CPV>=CSV) /*如果计数器达到预先设定的CSV，清零，OUT2输出一个高电平*/
//						{
//							OUT2 = 1;
//							CPV = 0;
//						}
//					}
//					/*显示OUT1和OUT2的状态*/
						SMG_DisplayOUT_STATUS(OUT1,OUT2);
//					LastRegisterA = RegisterA;
				}
    }  
    DMA_ClearITPendingBit(DMA_IT_TC);                   //清楚DMA中断标志位  
}  


void SMG_GPIO_INIT(void)
{
	
	   GPIO_InitTypeDef gpio_init_structure;  
    //??GPIO??  
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE); 
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB, ENABLE);  
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOC, ENABLE);  
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOD, ENABLE);  
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOE, ENABLE);  
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOF, ENABLE);  
	
    GPIO_StructInit(&gpio_init_structure);  
	
			//GPIOD3
    gpio_init_structure.GPIO_Pin = GPIO_Pin_10;  
    gpio_init_structure.GPIO_Mode = GPIO_Mode_OUT;                  
    gpio_init_structure.GPIO_OType = GPIO_OType_PP;                
    gpio_init_structure.GPIO_Speed = GPIO_Speed_50MHz;              
    gpio_init_structure.GPIO_PuPd= GPIO_PuPd_UP;                    
		GPIO_Init(GPIOA, &gpio_init_structure);  

		//GPIOD2~4
    gpio_init_structure.GPIO_Pin = D4_Pin;  
    gpio_init_structure.GPIO_Mode = GPIO_Mode_OUT;                  
    gpio_init_structure.GPIO_OType = GPIO_OType_PP;                
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              
    gpio_init_structure.GPIO_PuPd= GPIO_PuPd_UP;                    
    GPIO_Init(D4_GPIO_Port, &gpio_init_structure); 
		gpio_init_structure.GPIO_Pin = D3_Pin;
		GPIO_Init(D3_GPIO_Port, &gpio_init_structure);  
		gpio_init_structure.GPIO_Pin = D2_Pin;
		GPIO_Init(D2_GPIO_Port, &gpio_init_structure); 
		gpio_init_structure.GPIO_Pin = D1_Pin;
		GPIO_Init(D1_GPIO_Port, &gpio_init_structure); 
	  //GPIOD5~7                                                       
    gpio_init_structure.GPIO_Pin = D5_Pin;  
    gpio_init_structure.GPIO_Mode = GPIO_Mode_OUT;                   
    gpio_init_structure.GPIO_OType = GPIO_OType_PP;                
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;             
    gpio_init_structure.GPIO_PuPd= GPIO_PuPd_UP;                  
    GPIO_Init(D5_GPIO_Port, &gpio_init_structure); 
		gpio_init_structure.GPIO_Pin = D6_Pin;  		
		GPIO_Init(D6_GPIO_Port, &gpio_init_structure);  
		gpio_init_structure.GPIO_Pin = D7_Pin;  
		GPIO_Init(D7_GPIO_Port, &gpio_init_structure);  
		//GPIOA                                                        
    gpio_init_structure.GPIO_Pin = D8_Pin|D9_Pin;  
    gpio_init_structure.GPIO_Mode = GPIO_Mode_OUT;                  
    gpio_init_structure.GPIO_OType = GPIO_OType_PP;                 
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              
    gpio_init_structure.GPIO_PuPd= GPIO_PuPd_UP;                    
    GPIO_Init(D8_GPIO_Port, &gpio_init_structure);  
		gpio_init_structure.GPIO_Pin = D9_Pin;  
		GPIO_Init(D9_GPIO_Port, &gpio_init_structure);  

		//GPIOB
	  gpio_init_structure.GPIO_Pin = A_Pin;  
    gpio_init_structure.GPIO_Mode = GPIO_Mode_OUT;                  
    gpio_init_structure.GPIO_OType = GPIO_OType_PP;                 
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              
    gpio_init_structure.GPIO_PuPd= GPIO_PuPd_DOWN; 
		GPIO_Init(A_GPIO_Port, &gpio_init_structure);
		gpio_init_structure.GPIO_Pin = B_Pin; 
		GPIO_Init(B_GPIO_Port, &gpio_init_structure);
		gpio_init_structure.GPIO_Pin = C_Pin; 
		GPIO_Init(C_GPIO_Port, &gpio_init_structure);
		gpio_init_structure.GPIO_Pin = D_Pin; 
		GPIO_Init(D_GPIO_Port, &gpio_init_structure);
		gpio_init_structure.GPIO_Pin = E_Pin; 
		GPIO_Init(E_GPIO_Port, &gpio_init_structure);
		gpio_init_structure.GPIO_Pin = F_Pin; 
		GPIO_Init(F_GPIO_Port, &gpio_init_structure);
		gpio_init_structure.GPIO_Pin = G_Pin; 
		GPIO_Init(G_GPIO_Port, &gpio_init_structure); 
		
		
		GPIO_WriteBit(D1_GPIO_Port, D1_Pin, Bit_SET);
		GPIO_WriteBit(D2_GPIO_Port, D2_Pin, Bit_SET);
		GPIO_WriteBit(D3_GPIO_Port, D3_Pin, Bit_SET);
		GPIO_WriteBit(D4_GPIO_Port, D4_Pin, Bit_SET);
		GPIO_WriteBit(D5_GPIO_Port, D5_Pin, Bit_SET);
		GPIO_WriteBit(D6_GPIO_Port, D6_Pin, Bit_SET);
		GPIO_WriteBit(D7_GPIO_Port, D7_Pin, Bit_SET);
		GPIO_WriteBit(D8_GPIO_Port, D8_Pin, Bit_SET);
		GPIO_WriteBit(D9_GPIO_Port, D9_Pin, Bit_SET);

		GPIO_WriteBit(A_GPIO_Port, A_Pin, Bit_SET);
		GPIO_WriteBit(B_GPIO_Port, B_Pin, Bit_SET);
		GPIO_WriteBit(C_GPIO_Port, C_Pin, Bit_SET);
		GPIO_WriteBit(D_GPIO_Port, D_Pin, Bit_SET);
		GPIO_WriteBit(E_GPIO_Port, E_Pin, Bit_SET);
		GPIO_WriteBit(F_GPIO_Port, F_Pin, Bit_SET);
		GPIO_WriteBit(G_GPIO_Port, G_Pin, Bit_SET);

