HarryZeng/STM32F051_LHSP6/MDK-ARM/main.c
}

void IO_GPIO_INIT(void)
{
		GPIO_InitTypeDef gpio_init_structure;  
    //??GPIO??  
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE); 
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB, ENABLE);  
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOC, ENABLE);  
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOD, ENABLE);  
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOE, ENABLE);  
		RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOF, ENABLE);  
	
    GPIO_StructInit(&gpio_init_structure);  
	
		//OUT1_GPIO_Port,OUT2_GPIO_Port
    gpio_init_structure.GPIO_Pin = COMPOUT_Pin;  
    gpio_init_structure.GPIO_Mode = GPIO_Mode_OUT;                  
    gpio_init_structure.GPIO_OType = GPIO_OType_PP;                
    gpio_init_structure.GPIO_Speed = GPIO_Speed_50MHz;              
    gpio_init_structure.GPIO_PuPd= GPIO_PuPd_UP;                    
		GPIO_Init(COMPOUT_GPIO_Port, &gpio_init_structure);
	
			//OUT1_GPIO_Port,OUT2_GPIO_Port
    gpio_init_structure.GPIO_Pin = OUT2_Pin;  
    gpio_init_structure.GPIO_Mode = GPIO_Mode_OUT;                  
    gpio_init_structure.GPIO_OType = GPIO_OType_PP;                
    gpio_init_structure.GPIO_Speed = GPIO_Speed_50MHz;              
    gpio_init_structure.GPIO_PuPd= GPIO_PuPd_UP;                    
		GPIO_Init(OUT2_GPIO_Port, &gpio_init_structure); 
	
		//SC_GPIO_Port
    gpio_init_structure.GPIO_Pin = SC_Pin;  
    gpio_init_structure.GPIO_Mode = GPIO_Mode_IN;                                
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              
    gpio_init_structure.GPIO_PuPd= GPIO_PuPd_NOPULL;                    
		GPIO_Init(SC_GPIO_Port, &gpio_init_structure);
		
		//ATT_GPIO_Port
    gpio_init_structure.GPIO_Pin = ATT_Pin;  
    gpio_init_structure.GPIO_Mode = GPIO_Mode_OUT;                                
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              
    gpio_init_structure.GPIO_PuPd= GPIO_PuPd_NOPULL;                    
		GPIO_Init(ATT_GPIO_Port, &gpio_init_structure);
		
    gpio_init_structure.GPIO_Pin = FB_SC_Pin;  
    gpio_init_structure.GPIO_Mode = GPIO_Mode_OUT;                                
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              
    gpio_init_structure.GPIO_PuPd= GPIO_PuPd_NOPULL;                    
		GPIO_Init(FB_SC_GPIO_Port, &gpio_init_structure);

}

void DAC_GPIO_Init(void)
{
		GPIO_InitTypeDef gpio_init_structure;  
    //??GPIO??  
    RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA, ENABLE); 
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, ENABLE);
	
	
	  gpio_init_structure.GPIO_Pin = DACOUT_Pin;  
    gpio_init_structure.GPIO_Mode = GPIO_Mode_AN;                                
    gpio_init_structure.GPIO_Speed = GPIO_Speed_2MHz;              
    gpio_init_structure.GPIO_PuPd= GPIO_PuPd_NOPULL;                    
		GPIO_Init(DACOUT_GPIO_Port, &gpio_init_structure);
}

void DAC_OUT_Init(void)
{
		DAC_InitTypeDef DAC_InitStructure;
		
		DAC_GPIO_Init();
		
		DAC_InitStructure.DAC_Trigger = DAC_Trigger_Software ; 
		DAC_InitStructure.DAC_WaveGeneration = DAC_WaveGeneration_None;
		DAC_InitStructure.DAC_LFSRUnmask_TriangleAmplitude = DAC_LFSRUnmask_Bits11_0;
		DAC_InitStructure.DAC_OutputBuffer = DAC_OutputBuffer_Enable;
		DAC_Init(DAC_Channel_1,&DAC_InitStructure);
		
		DAC_Cmd(DAC_Channel_1,ENABLE);
}

	
void RCC_Configuration(void)
{
			RCC_DeInit();//??? RCC?????????
			RCC_HSICmd(ENABLE);//??HSI
			while(RCC_GetFlagStatus(RCC_FLAG_HSIRDY) == RESET)//??HSI???? 
			{
			}
			RCC_HCLKConfig(RCC_SYSCLK_Div1);
			RCC_PCLKConfig(RCC_HCLK_Div1);
			
			RCC_PLLConfig(RCC_PLLSource_HSI_Div2,RCC_PLLMul_12);
			RCC_PLLCmd(ENABLE);
			RCC_ADCCLKConfig(RCC_ADCCLK_PCLK_Div4);
			while(RCC_GetFlagStatus(RCC_FLAG_PLLRDY)==RESET)
			{
				
			}
			
			RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);
			
			while(RCC_GetSYSCLKSource()!=0x08)
			{
			}
		
//		PWR_BackupAccessCmd(ENABLE);//允许修改RTC和后备寄存器
//		RCC_LSEConfig(RCC_LSE_OFF);//关闭外部低速时钟
//		PWR_BackupAccessCmd(DISABLE);//禁止修改RTC和后备寄存器
}

void DelaymsSet(int16_t ms)
{
		while(1)
		{
			ms--;
			if(ms<=0)
				break;
		}
}

uint8_t CheckFLag;
int main(void)
{
		uint32_t checkcouter;
		RCC_Configuration();
		SMG_GPIO_INIT();
		user_adc_init();
		RCC_GetClocksFreq(&SysClock);
		bsp_InitI2C();
		DAC_OUT_Init();
		IO_GPIO_INIT();
		Button_Init();
		DelaymsSet(200); 
			
		CheckFLag = FlashCheck();
	
		if(CheckFLag)
			differenttialDC();
		else
			while(1)
			{
				checkcouter++;
			}
}

#define 	FLASH_START_ADDR1 	 						0x08008000
uint8_t* UID=(uint8_t*)0x1FFFF7AC;  //获取UID  
uint32_t Fml_Constant 	= 0x19101943;//输入到公式的常熟
uint8_t *C= (uint8_t*)&Fml_Constant;//把常量转化成数组
uint8_t FormulaResult[4];
uint32_t FormulaCheck;
uint32_t UIDFlashResult;
uint16_t Fml_CRC16;
uint8_t D[12];

void Formula_100(uint8_t *D,uint8_t *Result)
{
	D[0] = UID[4];
	D[1] = UID[8];
	D[2] = UID[1];
	D[3] = UID[3];
	D[4] = UID[0];
	D[5] = UID[5];
	D[6] = UID[10];
	D[7] = UID[7];
	D[8] = UID[9];
	D[9] = UID[2];
	D[10] = UID[11];
	D[11] = UID[6];
	
	Result[0] = C[0] ^ D[0];
	Result[1] = C[1] ^ D[6] ^ D[7] ^ D[8] ^ D[9] ^ D[10] ^ D[11] ;
	Result[2] = C[2] ^ D[4] ;
	Result[3] = C[3] ^ D[2] ^ D[1];
}

uint8_t FlashCheck(void)
{
		uint8_t FlashFlag;
		Formula_100(D,FormulaResult);
		FormulaCheck = FormulaResult[0]+(FormulaResult[1]<<8)+(FormulaResult[2]<<16)+(FormulaResult[3]<<24);
		UIDFlashResult = *(__IO uint32_t*)(FLASH_START_ADDR1);
		if(UIDFlashResult==FormulaCheck)
			FlashFlag =1;
		else
			FlashFlag =0;
		
		return FlashFlag;
			
}
uint16_t Formula_CRC16(uint8_t *p,uint8_t len)
{
	uint8_t i;
	while(len--)
	{
		for(i=0x80; i!=0; i>>=1)
		{
			if((Fml_CRC16 & 0x8000) != 0)
			{
				Fml_CRC16 <<= 1;
				Fml_CRC16 ^= 0x1021;
			}
			else
			{
				Fml_CRC16 <<= 1;
			}
			if((*p&i)!=0)
			{
				Fml_CRC16 ^= 0x1021;
			}
		}
		p++;
	}
	return Fml_CRC16;
}
